In [10]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import pickle

In [20]:
df=pd.read_csv('hiring.csv')
df

  experience  test_score  interview_score  salary
0        NaN         8.0                9   50000
1        NaN         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [23]:
df['experience'].fillna(0,inplace=True)
df

  experience  test_score  interview_score  salary
0          0         8.0                9   50000
1          0         8.0                6   45000
2       five         6.0                7   60000
3        two        10.0               10   65000
4      seven         9.0                6   70000
5      three         7.0               10   62000
6        ten         NaN                7   72000
7     eleven         7.0                8   80000

In [24]:
df['test_score'].fillna(df['test_score'].mean(),inplace=True)
df

  experience  test_score  interview_score  salary
0          0    8.000000                9   50000
1          0    8.000000                6   45000
2       five    6.000000                7   60000
3        two   10.000000               10   65000
4      seven    9.000000                6   70000
5      three    7.000000               10   62000
6        ten    7.857143                7   72000
7     eleven    7.000000                8   80000

In [27]:
#Converting words to integer values
def convert_to_int(word):
    word_dict={'one':1,'two':2,'three':3,'four':4,'five':5,'six':6,'seven':7,'ten':10,'eleven':11,'zero':0,0:0}
    return word_dict[word]

In [28]:
X=df.iloc[:,:3]
X['experience']= X['experience'].apply(lambda x: convert_to_int(x))
X

   experience  test_score  interview_score
0           0    8.000000                9
1           0    8.000000                6
2           5    6.000000                7
3           2   10.000000               10
4           7    9.000000                6
5           3    7.000000               10
6          10    7.857143                7
7          11    7.000000                8

In [30]:
y=df.iloc[:,-1]

In [32]:
#Splitting Training and Test Set
#Since we have a very small dataset, we will train our model with all availabe data.
from sklearn.linear_model import LinearRegression

regressor= LinearRegression()

#Fitting model with trainig data
regressor.fit(X,y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [33]:
# Saving model to disk
pickle.dump(regressor,open('model.pkl','wb'))

In [34]:
# Loading model to compare the results
model=pickle.load(open('model.pkl','rb'))
print(model.predict([[2,9,6]]))

[53290.89255945]

In [35]:
print(model.predict([[5,7,6]]))

[57947.91862781]